{
  "id": "Nm2OpCu4yA1WTZ5B8hK0",
  "title": "Cloud Solutions Consultant",
  "company": "CloudVibe Technologies",
  "location": "Australia",
  "type": "Full-time",
  "level": "Executive",
  "salary": "$78,000-$98,000/year",
  "posted": "2025-06-11",
  "description": "<h3>CloudVibe Technologies Seeks Cloud Solutions Consultant (Full-Time)</h3><p><i>CloudVibe Technologies</i>, a Sydney-based tech consultancy, drives cloud transformation for clients in finance, healthcare, and retail. We’re looking for an experienced <b>Cloud Solutions Consultant</b> to lead our cloud initiatives.</p><p><b>About the Role</b><br>As an Executive, you’ll design and oversee cloud architectures that empower client success, guiding teams and stakeholders through complex transformations.</p><p><b>Your Duties</b><br><ul><li>Architect <b>cloud solutions</b> on AWS, Azure, or Google Cloud.<br>- Lead <i>cloud migrations</i> from planning to execution.<br>- Ensure <b>security and compliance</b> in cloud deployments.<br>- Collaborate with <i>client IT teams</i> for integration.<br>- Mentor <b>junior architects</b>.<br>- Develop <i>cloud strategy roadmaps</i>.<br>- Optimize <b>cloud performance</b> and costs.<br>- Stay informed about <i>cloud innovations</i>.<br>- Present <b>solutions</b> to executives.<br>- Manage <i>project budgets</i>.</li></ul><p><b>Qualifications</b><br>We need candidates with 6–8 years of experience in cloud architecture, proficient in AWS, Azure, or Google Cloud. Strong leadership and strategic planning skills are essential, along with cloud security knowledge. Excellent stakeholder communication is required. A Bachelor’s degree in computer science, IT, or a related field is necessary.</p><p><b>Why CloudVibe?</b><br>We’re innovators pushing technology forward. Our <i>hybrid work model</i> balances flexibility and collaboration. We offer <b>certifications</b>, conferences, and premium tools to support your growth. You’ll tackle high-impact projects in a creative environment.</p><p><b>Benefits</b><br>Health and dental insurance<br>Superannuation contributions<br>25 days of annual leave<br>Certification budget<br>Access to cloud platforms<br>Team retreats</p><p><b>Apply Today</b><br>Lead cloud transformation with CloudVibe Technologies. Submit your application now!</p><p>#CloudVibeCareers #CloudSolutions #HiringNow</p>",
  "requirements": [],
  "verified": false
}