{
  "id": "Gr4StEy9cF6AXD0G2lO5",
  "title": "AI Developer",
  "company": "CoreSync AI",
  "location": "Japan",
  "type": "Full-time",
  "level": "Senior Staff",
  "salary": "$37,000-$50,000/year",
  "posted": "2025-06-03",
  "description": "<h3>CoreSync AI is Hiring an AI Developer (Full-Time)</h3><p><i>CoreSync AI</i>, a Tokyo-based tech firm, develops AI solutions for clients in finance, healthcare, and retail. We’re seeking a skilled <b>AI Developer</b> to join our team and build innovative AI models.</p><p><b>About the Role</b><br>You’ll design and deploy AI applications that enhance client operations, working with data scientists and engineers to deliver cutting-edge solutions.</p><p><b>Your Responsibilities</b><br><ul><li>Develop <b>AI models</b> using TensorFlow or PyTorch.<br>- Collaborate with teams to refine <i>algorithms</i>.<br>- Integrate <b>AI solutions</b> with client systems.<br>- Optimize <i>model performance</i> and accuracy.<br>- Document <b>solutions</b> for client use.<br>- Conduct <i>performance testing</i> to ensure reliability.<br>- Stay informed about <b>AI advancements</b>.<br>- Support <i>client training</i> on AI tools.<br>- Contribute to <b>AI strategy</b> development.<br>- Participate in <i>code reviews</i> and best practices.</li></ul><p><b>Qualifications Required</b><br>Candidates should have 3–5 years of experience in AI or machine learning, with proficiency in TensorFlow, PyTorch, or Python. Experience with cloud platforms (AWS, Azure) and strong problem-solving skills are essential. A Bachelor’s degree in computer science or a related field is required.</p><p><b>Why CoreSync?</b><br>We’re a team of innovators pushing the boundaries of AI. Our <i>hybrid work environment</i> offers flexibility, and we provide <b>continuous learning</b> opportunities through certifications and conferences. You’ll work on impactful projects in a collaborative, supportive culture.</p><p><b>Perks</b><br>- Health insurance<br>- Commuter allowance<br>- 20 days of annual leave<br>- AI certification budget<br>- Access to AI tools<br>- Team-building events</p><p><b>Apply Today</b><br>Join CoreSync AI and shape the future of AI. Submit your application now!</p><p>#CoreSyncCareers #AIDevelopment #HiringNow</p>",
  "requirements": [],
  "verified": false
}