{
  "id": "Wq2TyXs9pZ8MJV3U4dL7",
  "title": "Data Analytics Consultant",
  "company": "Deloitte",
  "location": "United Kingdom",
  "type": "Full-time",
  "level": "Senior Staff",
  "salary": "$65,000-$85,000",
  "posted": "2025-06-12",
  "description": "<h3><strong>Deloitte is Hiring – Data Analytics Consultant (Full-time)</strong></h3><p><strong>Deloitte</strong> is a global leader in consulting, delivering data-driven solutions to transform businesses. We’re looking for a <strong>Data Analytics Consultant</strong> in London to help clients leverage data for strategic growth.</p><p><strong>About the Role:</strong> You’ll design and implement analytics solutions, turning complex data into actionable insights for clients in finance, retail, and more. This role combines <strong>technical expertise</strong> with <strong>client-facing strategy</strong>.</p><h3><strong>Key Responsibilities</strong></h3><ul><li>Build <strong>dashboards and reports</strong> using Power BI, Tableau, and SQL.</li><li>Analyze datasets to identify <strong>business opportunities</strong> and risks.</li><li>Develop <strong>predictive models</strong> using Python or R.</li><li>Collaborate with clients to define <strong>analytics roadmaps</strong> and KPIs.</li><li>Ensure <strong>data compliance</strong> with GDPR and industry standards.</li><li>Mentor junior analysts and contribute to team knowledge sharing.</li></ul><h3><strong>Why Deloitte?</strong></h3><p>Work on <strong>high-impact projects</strong> with global clients. We offer <strong>flexible work arrangements</strong>, <strong>extensive training</strong>, and a commitment to diversity.</p><p><strong>Benefits:</strong> Pension plan, private healthcare, 25 days PTO, and access to Deloitte University.</p><p>📢 <strong>#DeloitteCareers #DataAnalytics #Consulting #WeAreHiring</strong></p>",
  "requirements": [
    "4–6 years of experience in data analytics or consulting",
    "Proficiency in Power BI, Tableau, SQL, and Python/R",
    "Strong client communication and presentation skills",
    "Knowledge of GDPR and data governance",
    "Bachelor’s degree in data science, statistics, or related field"
  ],
  "verified": false
}