{
  "id": "On3PqDv5zB2XUA6C9iL1",
  "title": "UX Designer",
  "company": "DesignFlow Studio",
  "location": "Canada",
  "type": "Full-time",
  "level": "Senior Staff",
  "salary": "$54,000-$68,000/year",
  "posted": "2025-06-10",
  "description": "<h3>DesignFlow Studio is Hiring a UX Designer (Full-Time)</h3><p><b>DesignFlow Studio</b>, a Toronto-based design agency, creates user-centric digital experiences for clients in tech, education, and healthcare. We’re seeking a talented <i>UX Designer</i> to craft intuitive interfaces.</p><p><b>Role Summary</b><br>You’ll design user experiences that delight users, working with product teams and clients to shape digital products from concept to launch.</p><p><b>Key Responsibilities</b><br>- Create <b>wireframes</b> and <i>prototypes</i> using Figma.<br>- Conduct <b>user research</b> to understand needs.<br>- Design <i>responsive interfaces</i> for web and mobile.<br>- Collaborate with developers for <b>design fidelity</b>.<br>- Perform <i>usability testing</i> to refine designs.<br>- Develop <b>style guides</b>.<br>- Optimize for <i>accessibility</i>.<br>- Stay updated on <b>UX trends</b>.<br>- Present <i>design concepts</i> to stakeholders.<br>- Support <b>product development</b>.</p><p><b>What We Need</b><br>Candidates should have 3–5 years of experience in UX design, proficient in Figma, Adobe XD, or Sketch. Strong user research and usability testing skills are essential, along with accessibility knowledge. Excellent collaboration and communication are required. A Bachelor’s degree in design, HCI, or a related field is necessary.</p><p><b>Why DesignFlow?</b><br>We’re a creative team that values innovation. Our <i>hybrid work model</i> offers flexibility. We support growth with <b>workshops</b> and design tools. You’ll work on diverse projects in a supportive environment.</p><p><b>Perks</b><br>Health, dental, and vision insurance<br>RRSP matching<br>20 days of annual leave<br>Design software access<br>Professional development budget<br>Team-building events</p><p><b>Join Us</b><br>Apply now to create user-focused designs with DesignFlow Studio!</p><p>#DesignFlowCareers #UXDesign #HiringNow</p>",
  "requirements": [],
  "verified": true
}