{
  "id": "Fq3RsDx8bE5ZWC9F1kN4",
  "title": "Content Marketing Specialist",
  "company": "GrowVibe Marketing",
  "location": "India",
  "type": "Full-time",
  "level": "Staff",
  "salary": "$8,000-$12,000/year",
  "posted": "2025-06-04",
  "description": "<h3>GrowVibe Marketing Seeks Content Marketing Specialist (Full-Time)</h3><p><b>GrowVibe Marketing</b>, a Mumbai-based agency, creates compelling content for clients in tech, education, and lifestyle. We’re excited to invite a <i>Content Marketing Specialist</i> to join our team and craft stories that engage audiences.</p><p><b>Role Overview</b><br>You’ll develop content strategies and create materials that drive brand awareness and engagement across digital platforms.</p><p><b>Key Duties</b><br>- Create <b>content</b> for blogs, social media, and email campaigns.<br>- Collaborate with designers to produce <i>visual assets</i>.<br>- Analyze performance using <b>Google Analytics</b> and <b>SEMrush</b>.<br>- Optimize content for <i>SEO</i> and engagement.<br>- Manage <b>content calendars</b> and deadlines.<br>- Conduct <i>audience research</i> to tailor content.<br>- Stay updated on <b>content marketing trends</b>.<br>- Prepare <i>performance reports</i> for clients.<br>- Support <b>client meetings</b> to discuss content strategies.<br>- Contribute to <i>thought leadership</i> content.</p><p><b>Qualifications</b><br>We’re looking for candidates with 2–3 years of experience in content marketing, proficient in Google Analytics, SEMrush, and SEO tools. Strong writing and editing skills are essential, along with experience in B2C content. A Bachelor’s degree in marketing, journalism, or a related field is required.</p><p><b>Why GrowVibe?</b><br>We’re a creative agency that values storytelling and innovation. Our <i>hybrid work model</i> offers flexibility, and we support your growth with <b>training programs</b> and access to premium tools. You’ll work on diverse projects in a collaborative environment.</p><p><b>Benefits</b><br>Health insurance<br>Provident fund contributions<br>18 days of annual leave<br>Professional development budget<br>Access to content tools<br>Team social events</p><p><b>Join Us</b><br>If you’re passionate about content marketing, apply now to join GrowVibe Marketing!</p><p>#GrowVibeCareers #ContentMarketing #HiringNow</p>",
  "requirements": [],
  "verified": true
}