{
  "id": "Bm9NoZt4xA1VSY5B7gJ0",
  "title": "Social Media Manager",
  "company": "GrowEasy Digital",
  "location": "Singapore",
  "type": "Part-time",
  "level": "Staff",
  "salary": "$20,000-$30,000/year",
  "posted": "2025-06-09",
  "description": "<h3>GrowEasy Digital is Recruiting a Social Media Manager (Part-Time)</h3><p>Located in the heart of Singapore, <b>GrowEasy Digital</b> is a boutique agency known for creating engaging social media campaigns for clients in lifestyle, tech, and education. We’re looking for a creative <i>Social Media Manager</i> to join our team and elevate our clients’ online presence.</p><p><b>Role Summary</b><br>This part-time role focuses on developing and managing social media strategies that amplify brand voices. You’ll have the flexibility to balance work with other commitments while making a significant impact on our clients’ digital success.</p><p><b>Key Tasks</b><br>- Develop <i>social media strategies</i> for platforms like Instagram, TikTok, and LinkedIn.<br>- Create and schedule <b>engaging content</b> that aligns with client branding.<br>- Monitor performance using <i>Sprout Social</i> and <i>Hootsuite</i> to optimize engagement.<br>- Manage <b>community interactions</b> to build brand loyalty.<br>- Conduct <i>competitor analysis</i> to identify differentiation opportunities.<br>- Work with designers to produce <b>visual content</b> that captures attention.<br>- Optimize <i>content performance</i> based on analytics insights.<br>- Stay updated on <b>social media trends</b> and emerging platforms.<br>- Prepare <i>monthly performance reports</i> for clients.<br>- Participate in <b>client meetings</b> to discuss strategy and results.</p><p><b>What We’re Looking For</b><br>We seek candidates with 1–3 years of experience in social media marketing, proficient in Sprout Social, Hootsuite, and analytics tools. Strong content creation and communication skills are essential, along with experience in community engagement. A Bachelor’s degree in marketing, communications, or a related field is required.</p><p><b>Why GrowEasy?</b><br>We’re a close-knit team that values creativity and flexibility. Our <i>remote-first</i> approach allows you to work from anywhere in Singapore, with occasional team meetups for collaboration. We provide <b>access to premium tools</b> and support your growth through workshops and courses. You’ll work on exciting projects that connect brands with their audiences in meaningful ways.</p><p><b>Benefits Offered</b><br>Health insurance for part-time staff<br>Flexible working hours<br>15 days of paid leave (pro-rated)<br>Access to social media tools<br>Professional development stipend<br>Team social events</p><p><b>Join Our Team</b><br>If you’re passionate about social media, apply now to join GrowEasy Digital!</p><p>#GrowEasyCareers #SocialMedia #HiringNow</p>",
  "requirements": [],
  "verified": true
}