{
  "id": "Kj9LmZr1vX8TQW2Y4eF7",
  "title": "Digital Campaign Analyst",
  "company": "NextWave Digital",
  "location": "United States",
  "type": "Full-time",
  "level": "Staff",
  "salary": "$55,000-$70,000/year",
  "posted": "2025-06-14",
  "description": "<h3>NextWave Digital is Seeking a Digital Campaign Analyst (Full-Time)</h3><p>At <b>NextWave Digital</b>, a vibrant marketing agency based in San Francisco, we specialize in crafting data-driven campaigns for clients in tech, healthcare, and education. We’re looking for a dedicated <i>Digital Campaign Analyst</i> to join our team and help optimize our clients’ digital strategies.</p><p><b>Role Overview</b><br>In this role, you’ll dive deep into campaign data, uncovering insights to enhance performance across digital channels. You’ll work closely with media planners, content creators, and clients to ensure campaigns achieve maximum impact.</p><p><b>Key Responsibilities</b><br>- Analyze <b>campaign performance</b> using tools like Google Analytics and Adobe Analytics.<br>- Create <i>dashboards</i> to track KPIs such as ROI, CTR, and conversions.<br>- Collaborate with media teams to refine <b>campaign strategies</b>.<br>- Conduct <i>A/B testing</i> to optimize ad creatives and targeting.<br>- Prepare <b>client reports</b> with actionable insights.<br>- Monitor <i>industry trends</i> to keep campaigns innovative.<br>- Support <b>budget planning</b> for digital campaigns.<br>- Engage with <i>client stakeholders</i> to align on goals.<br>- Contribute to <b>campaign brainstorming</b> sessions.<br>- Ensure <i>data accuracy</i> in all analytics tasks.</p><p><b>What We’re Looking For</b><br>We need candidates with 2–3 years of experience in digital analytics, proficient in Google Analytics, Adobe Analytics, and similar tools. Strong data analysis and reporting skills are essential, along with experience in A/B testing. Excellent communication and teamwork abilities are required. A Bachelor’s degree in marketing, data science, or a related field is necessary.</p><p><b>Why NextWave?</b><br>We’re a team that thrives on creativity and collaboration. Our <i>hybrid work model</i> offers flexibility, blending remote work with in-office innovation. We invest in your growth through <b>training programs</b>, certifications, and access to premium analytics tools. You’ll work on diverse projects that challenge you to think strategically and deliver results.</p><p><b>Benefits Package</b><br>Comprehensive health, dental, and vision insurance<br>401(k) with matching contributions<br>20 days of paid time off annually<br>Annual professional development budget<br>Access to analytics platforms<br>Team-building retreats and wellness initiatives</p><p><b>Join Our Team</b><br>If you’re passionate about data and digital marketing, apply today to make an impact with NextWave Digital!</p><p>#NextWaveCareers #DigitalMarketing #Analytics #HiringNow</p>",
  "requirements": [],
  "verified": true
}