{
  "id": "It6UvGa1eH8CZF2I4nQ7",
  "title": "Performance Marketing Analyst",
  "company": "PeakPulse Digital",
  "location": "UAE",
  "type": "Part-time",
  "level": "Staff",
  "salary": "$20,000-$30,000/year",
  "posted": "2025-06-01",
  "description": "<h3>PeakPulse Digital is Hiring a Performance Marketing Analyst (Part-Time)</h3><p><i>PeakPulse Digital</i>, a Dubai-based digital agency, drives ROI-focused campaigns for clients in hospitality, tech, and retail. We’re seeking a skilled <b>Performance Marketing Analyst</b> to optimize our paid media efforts.</p><p><b>About the Role</b><br>You’ll analyze and optimize paid media campaigns, ensuring maximum ROI for our clients in this flexible part-time role.</p><p><b>Your Duties</b><br><ul><li>Analyze <b>paid media campaigns</b> on Google Ads and Meta.<br>- Track performance with <i>Google Analytics</i> and <i>Adobe Analytics</i>.<br>- Optimize campaigns for <b>conversions</b> and cost-efficiency.<br>- Collaborate with creative teams for <i>ad content</i>.<br>- Prepare <b>performance reports</b> for clients.<br>- Conduct <i>A/B testing</i> to improve outcomes.<br>- Stay updated on <b>performance marketing trends</b>.<br>- Support <i>client meetings</i> to discuss results.<br>- Contribute to <b>budget optimization</b>.<br>- Monitor <i>competitor campaigns</i> for insights.</li></ul><p><b>What We Need</b><br>Candidates should have 1–3 years of experience in performance marketing, proficient in Google Ads, Meta Ads, Google Analytics, and Adobe Analytics. Strong data analysis and optimization skills are essential, along with experience in paid media campaigns. A Bachelor’s degree in marketing, business, or a related field is required.</p><p><b>Why PeakPulse?</b><br>We’re a dynamic agency that values results and flexibility. Our <i>remote-first</i> approach allows you to work from anywhere in Dubai, with occasional team meetups. We provide <b>access to premium tools</b> and support your growth through training and certifications.</p><p><b>Perks</b><br>Health insurance<br>Flexible hours<br>15 days of paid leave (pro-rated)<br>Access to analytics tools<br>Professional development stipend<br>Team social events</p><p><b>Apply Now</b><br>Join PeakPulse Digital and drive campaign success. Submit your application today!</p><p>#PeakPulseCareers #PerformanceMarketing #HiringNow</p>",
  "requirements": [],
  "verified": false
}