{
  "id": "Zk7RtYp3mX9LQV2W4fG8",
  "title": "Digital Strategy Consultant",
  "company": "Publicis Sapient",
  "location": "United States",
  "type": "Full-time",
  "level": "Senior Staff",
  "salary": "$125,000-$150,000",
  "posted": "2025-06-15",
  "description": "<h3><strong>Publicis Sapient is Hiring – Digital Strategy Consultant (Full-time)</strong></h3><p>At <strong>Publicis Sapient</strong>, we’re a global leader in digital transformation, helping clients like Fortune 500 companies reimagine their businesses through technology and innovation. We’re seeking a <strong>Digital Strategy Consultant</strong> to drive impactful strategies that shape the future of our clients’ digital ecosystems.</p><p><strong>About the Role:</strong> You’ll partner with clients across industries to develop cutting-edge digital strategies, leveraging data, technology, and customer insights to deliver measurable business outcomes. This role is about <strong>leading transformation</strong>, not just advising—it’s about creating solutions that redefine markets.</p><h3><strong>Key Responsibilities</strong></h3><ul><li>Lead the development of <strong>digital transformation strategies</strong> for clients, aligning with their business goals.</li><li>Conduct <strong>market and competitive analysis</strong> to identify opportunities for innovation.</li><li>Collaborate with cross-functional teams (UX, engineering, data science) to design and implement <strong>end-to-end solutions</strong>.</li><li>Use tools like <strong>Google Analytics, Tableau, and Adobe Experience Cloud</strong> to measure and optimize strategy performance.</li><li>Present strategic recommendations to <strong>C-level executives</strong>, driving stakeholder buy-in.</li><li>Stay ahead of <strong>digital trends</strong> in AI, cloud, and customer experience.</li></ul><h3><strong>Why Publicis Sapient?</strong></h3><p>Join a culture of <strong>innovation and impact</strong>. We offer <strong>flexible work arrangements</strong>, <strong>continuous learning</strong> through our global training programs, and the chance to work with <strong>world-class clients</strong>. Your ideas will shape industries.</p><p><strong>Benefits:</strong> Competitive salary, health insurance, 401(k) matching, generous PTO, and access to cutting-edge tech resources.</p><p>📢 <strong>#PublicisSapientCareers #DigitalStrategy #Transformation #WeAreHiring</strong></p>",
  "requirements": [
    "5–7 years of experience in digital strategy or consulting, ideally in a digital agency or tech firm",
    "Proven track record of leading digital transformation projects",
    "Expertise in analytics tools (e.g., Google Analytics, Tableau, Adobe Experience Cloud)",
    "Strong presentation and stakeholder management skills",
    "Deep understanding of digital trends (AI, cloud, customer experience)",
    "Bachelor’s degree in business, marketing, or related field; MBA preferred"
  ],
  "verified": true
}