{
  "id": "Do1PqBv6zC3XUA7D9iL2",
  "title": "UX/UI Designer",
  "company": "SparkVibe Studio",
  "location": "Canada",
  "type": "Full-time",
  "level": "Senior Staff",
  "salary": "$54,000-$68,000/year",
  "posted": "2025-06-06",
  "description": "<h3>SparkVibe Studio Seeks a UX/UI Designer (Full-Time)</h3><p><b>SparkVibe Studio</b>, a Vancouver-based digital design agency, creates user-centric experiences for clients in tech, education, and e-commerce. We’re excited to welcome a talented <i>UX/UI Designer</i> to our team to craft intuitive and visually stunning interfaces.</p><p><b>Role Overview</b><br>You’ll design user experiences and interfaces that delight users and meet client objectives. Working with product managers, developers, and clients, you’ll shape digital products from concept to launch.</p><p><b>Key Responsibilities</b><br>- Create <b>wireframes</b> and <i>prototypes</i> using Figma or Adobe XD.<br>- Conduct <b>user research</b> to understand needs and behaviors.<br>- Design <i>responsive interfaces</i> for web and mobile platforms.<br>- Collaborate with developers to ensure <b>design fidelity</b>.<br>- Perform <i>usability testing</i> to refine designs.<br>- Develop <b>style guides</b> and design systems.<br>- Optimize designs for <i>accessibility</i> and performance.<br>- Stay updated on <b>UX/UI trends</b> and tools.<br>- Present <i>design concepts</i> to clients and stakeholders.<br>- Support <b>cross-functional teams</b> in product development.</p><p><b>Qualifications Needed</b><br>We seek candidates with 3–5 years of experience in UX/UI design, proficient in Figma, Adobe XD, or Sketch. Strong user research and usability testing skills are essential, along with knowledge of accessibility standards. Excellent collaboration and communication abilities are required. A Bachelor’s degree in design, HCI, or a related field is necessary.</p><p><b>Why SparkVibe?</b><br>We’re a creative team that values innovation and collaboration. Our <i>hybrid work environment</i> offers flexibility, with opportunities for remote and in-office work. We support your growth through <b>workshops</b>, certifications, and access to design tools. You’ll work on diverse projects that push the boundaries of digital design.</p><p><b>Benefits</b><br>Health, dental, and vision insurance<br>RRSP matching program<br>20 days of annual leave<br>Professional development budget<br>Access to design software<br>Team-building events and wellness programs</p><p><b>Join Our Studio</b><br>If you’re passionate about creating user-focused designs, apply now to join SparkVibe Studio!</p><p>#SparkVibeCareers #UXDesign #HiringNow</p>",
  "requirements": [],
  "verified": true
}