{
  "id": "Cn0OpAu5yB2WTZ6C8hK1",
  "title": "Cloud Solutions Architect",
  "company": "TechTrend Innovations",
  "location": "Australia",
  "type": "Full-time",
  "level": "Executive",
  "salary": "$78,000-$98,000/year",
  "posted": "2025-06-07",
  "description": "<h3>Cloud Solutions Architect Position at TechTrend Innovations (Full-Time)</h3><p><i>TechTrend Innovations</i>, a premier tech consultancy in Melbourne, drives cloud transformation for clients in finance, healthcare, and retail. We’re seeking a seasoned <b>Cloud Solutions Architect</b> to lead our cloud initiatives and deliver innovative solutions.</p><p><b>About the Position</b><br>As an Executive, you’ll design and oversee cloud architectures that empower our clients’ business goals. Your strategic vision and technical expertise will be critical in shaping their cloud journey.</p><p><b>Your Duties</b><br><ul><li>Design <b>cloud architectures</b> on AWS, Azure, or Google Cloud.<br>- Lead <i>cloud migration projects</i> from strategy to implementation.<br>- Ensure <b>security and compliance</b> in cloud environments.<br>- Collaborate with <i>client IT teams</i> for seamless integration.<br>- Mentor <b>junior architects</b> and engineers.<br>- Develop <i>cloud strategy roadmaps</i> for clients.<br>- Optimize <b>cloud performance</b> and cost-efficiency.<br>- Stay informed about <i>cloud technology advancements</i>.<br>- Present <b>solutions</b> to executive stakeholders.<br>- Manage <i>project budgets</i> and timelines.</li></ul><p><b>Requirements</b><br>We’re looking for candidates with 6–8 years of experience in cloud architecture, with expertise in AWS, Azure, or Google Cloud. Strong leadership and strategic planning skills are essential, along with knowledge of cloud security and compliance. Excellent communication with stakeholders is required. A Bachelor’s degree in computer science, IT, or a related field is necessary.</p><p><b>Why TechTrend?</b><br>We’re a team of innovators dedicated to pushing technology forward. Our <i>hybrid work model</i> balances flexibility and collaboration. We support your growth with <b>certifications</b>, conferences, and access to premium tools. You’ll tackle high-impact projects in a culture that values expertise and creativity.</p><p><b>Perks</b><br>- Comprehensive health and dental insurance<br>- Superannuation with employer contributions<br>- 25 days of annual leave<br>- Certification and training budget<br>- Access to cloud platforms<br>- Team retreats and wellness initiatives</p><p><b>Apply Today</b><br>Lead the future of cloud solutions with TechTrend Innovations. Submit your application now!</p><p>#TechTrendCareers #CloudArchitecture #HiringNow</p>",
  "requirements": [],
  "verified": false
}