{
  "id": "Ml1NoBt3xZ0VSY4A7gJ9",
  "title": "Social Media Strategist",
  "company": "TrendSync Media",
  "location": "Singapore",
  "type": "Part-time",
  "level": "Staff",
  "salary": "$20,000-$30,000/year",
  "posted": "2025-06-12",
  "description": "<h3>TrendSync Media is Looking for a Social Media Strategist (Part-Time)</h3><p>Based in Singapore, <b>TrendSync Media</b> is a boutique agency crafting vibrant social media campaigns for clients in lifestyle, tech, and education. We’re seeking a creative <i>Social Media Strategist</i> to elevate our clients’ online presence.</p><p><b>Role Summary</b><br>This part-time role focuses on developing social media strategies that amplify brand voices, offering flexibility to balance creative work with other commitments.</p><p><b>Key Tasks</b><br>- Create <b>social media strategies</b> for Instagram, TikTok, and LinkedIn.<br>- Schedule <i>engaging content</i> aligned with client branding.<br>- Monitor performance using <b>Sprout Social</b> and <b>Hootsuite</b>.<br>- Manage <i>community interactions</i> to build loyalty.<br>- Conduct <b>competitor analysis</b> for differentiation.<br>- Collaborate with designers for <i>visual content</i>.<br>- Optimize <b>content performance</b> based on analytics.<br>- Stay updated on <i>social media trends</i>.<br>- Prepare <b>monthly reports</b> for clients.<br>- Support <i>client meetings</i> on strategy.</p><p><b>What We Need</b><br>Candidates should have 1–3 years of experience in social media marketing, proficient in Sprout Social, Hootsuite, and analytics tools. Strong content creation and communication skills are essential, along with community engagement experience. A Bachelor’s degree in marketing, communications, or a related field is required.</p><p><b>Why TrendSync?</b><br>We’re a small team that values creativity and flexibility. Our <i>remote-first</i> approach allows work from anywhere in Singapore, with occasional meetups for collaboration. We provide <b>premium tools</b> and support growth through workshops and courses.</p><p><b>Perks</b><br>Health insurance for part-time staff<br>Flexible hours<br>15 days of paid leave (pro-rated)<br>Access to social media tools<br>Professional development stipend<br>Team social events</p><p><b>Join Us</b><br>Apply now to create impactful social media campaigns with TrendSync Media!</p><p>#TrendSyncCareers #SocialMedia #HiringNow</p>",
  "requirements": [],
  "verified": true
}