{
  "id": "Hs5TuFz0dG7BYE1H3mP6",
  "title": "Media Planner",
  "company": "TrendWave Media",
  "location": "Brazil",
  "type": "Full-time",
  "level": "Staff",
  "salary": "$11,000-$16,000/year",
  "posted": "2025-06-02",
  "description": "<h3>TrendWave Media Seeks a Media Planner (Full-Time)</h3><p><b>TrendWave Media</b>, a São Paulo-based media agency, optimizes campaigns for clients in retail, education, and tech. We’re looking for a dedicated <i>Media Planner</i> to join our team and craft effective media strategies.</p><p><b>Role Summary</b><br>You’ll plan and execute media campaigns to maximize client ROI, working with creative and analytics teams to deliver impactful results.</p><p><b>Key Tasks</b><br>- Develop <b>media plans</b> for digital and traditional channels.<br>- Analyze <i>audience data</i> using Nielsen or Comscore.<br>- Negotiate with <b>media vendors</b> for optimal placements.<br>- Track <i>campaign performance</i> and optimize spend.<br>- Collaborate with creative teams for <b>campaign alignment</b>.<br>- Conduct <i>market research</i> to inform strategies.<br>- Stay updated on <b>media trends</b>.<br>- Prepare <i>performance reports</i> for clients.<br>- Support <b>client meetings</b> to discuss plans.<br>- Contribute to <i>budget planning</i> for campaigns.</p><p><b>Qualifications</b><br>We seek candidates with 2–3 years of experience in media planning, proficient in Nielsen or Comscore. Strong negotiation and analytical skills are essential, along with experience in digital and traditional media. A Bachelor’s degree in marketing, advertising, or a related field is required.</p><p><b>Why TrendWave?</b><br>We’re a team that values strategic thinking and creativity. Our <i>hybrid work model</i> offers flexibility, and we support your growth with <b>training programs</b> and access to media tools. You’ll work on diverse projects in a collaborative environment.</p><p><b>Benefits</b><br>Health plan<br>Meal vouchers<br>20 days of annual leave<br>Professional development budget<br>Access to media tools<br>Team social events</p><p><b>Join Us</b><br>If you’re passionate about media planning, apply now to join TrendWave Media!</p><p>#TrendWaveCareers #MediaPlanning #HiringNow</p>",
  "requirements": [],
  "verified": true
}