{
  "id": "Ju7VwHb2fI9DAG3J5oR8",
  "title": "Business Intelligence Analyst",
  "company": "VibeCore Analytics",
  "location": "France",
  "type": "Full-time",
  "level": "Staff",
  "salary": "$35,000-$48,000/year",
  "posted": "2025-05-31",
  "description": "<h3>VibeCore Analytics is Recruiting a Business Intelligence Analyst (Full-Time)</h3><p><b>VibeCore Analytics</b>, a Paris-based analytics firm, delivers insights for clients in finance, retail, and tech. We’re excited to invite a <i>Business Intelligence Analyst</i> to join our team and drive data-driven decisions.</p><p><b>Role Overview</b><br>You’ll create BI solutions to help clients optimize their strategies, working with data to uncover actionable insights.</p><p><b>Key Responsibilities</b><br>- Develop <b>BI reports</b> using Power BI and SQL.<br>- Analyze business data to identify <i>key trends</i>.<br>- Collaborate with clients to define <b>reporting needs</b>.<br>- Optimize <i>data models</i> for performance.<br>- Train clients on <b>BI tools</b>.<br>- Conduct <i>data quality checks</i>.<br>- Stay updated on <b>BI trends</b>.<br>- Prepare <i>client presentations</i> with insights.<br>- Support <b>project planning</b> for BI initiatives.<br>- Contribute to <i>team knowledge sharing</i>.</p><p><b>Qualifications Needed</b><br>We seek candidates with 2–3 years of experience in business intelligence, proficient in Power BI and SQL. Strong data visualization and communication skills are essential, along with experience in client-facing projects. A Bachelor’s degree in data science, business, or a related field is required.</p><p><b>Why VibeCore?</b><br>We’re a team that values data and collaboration. Our <i>hybrid work model</i> offers flexibility, and we provide <b>training programs</b> to keep you at the forefront of BI. You’ll work on impactful projects in a supportive environment.</p><p><b>Benefits</b><br>Health insurance<br>Pension plan<br>25 days of annual leave<br>Professional development budget<br>Access to BI tools<br>Team-building events</p><p><b>Join Us</b><br>If you’re passionate about business intelligence, apply now to join VibeCore Analytics!</p><p>#VibeCoreCareers #BusinessIntelligence #HiringNow</p>",
  "requirements": [],
  "verified": true
}