{
  "id": "Kp9LmZr1vX8TQW2Y4eF7",
  "title": "Digital Marketing Analyst",
  "company": "VML",
  "location": "United States",
  "type": "Full-time",
  "level": "Staff",
  "salary": "$60,000-$75,000/year",
  "posted": "2025-06-14",
  "description": "<h3><strong>VML is Hiring – Digital Marketing Analyst (Full-time)</strong></h3><p>At <strong>VML</strong>, a global digital marketing agency, we create connected brand experiences that drive results. We’re seeking a <strong>Digital Marketing Analyst</strong> in New York to analyze and optimize digital campaigns for our diverse client portfolio.</p><p><strong>About the Role:</strong> You’ll dive into campaign data, uncover insights, and recommend strategies to boost performance across channels like social, search, and programmatic advertising.</p><h3><strong>Key Responsibilities</strong></h3><ul><li>Analyze <strong>campaign performance</strong> using Google Analytics, Adobe Analytics, and CRM tools.</li><li>Develop <strong>dashboards and reports</strong> to track KPIs like ROI, CTR, and conversions.</li><li>Collaborate with media and creative teams to align <strong>campaign strategies</strong>.</li><li>Optimize <strong>paid media campaigns</strong> on Google Ads, Meta, and LinkedIn.</li><li>Conduct <strong>A/B testing</strong> to improve campaign outcomes.</li><li>Stay updated on <strong>digital marketing trends</strong> and tools.</li></ul><h3><strong>Why VML?</strong></h3><p>Join a <strong>collaborative, innovative team</strong> working with global brands. We offer <strong>hybrid work options</strong>, <strong>continuous learning</strong>, and a culture that celebrates bold ideas.</p><p><strong>Benefits:</strong> Health, dental, and vision insurance, 401(k) matching, 20 days PTO, and access to industry-leading tools.</p><p>📢 <strong>#VMLCareers #DigitalMarketing #Analytics #WeAreHiring</strong></p>",
  "requirements": [
    "2–4 years of experience in digital marketing or analytics",
    "Proficiency in Google Analytics, Adobe Analytics, and Google Ads",
    "Strong data analysis and reporting skills",
    "Experience with CRM platforms (e.g., Salesforce, HubSpot)",
    "Bachelor’s degree in marketing, business, or related field"
  ],
  "verified": true
}